# Taps
tap "nikitabobko/tap"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "lizardbyte/homebrew"

# --- Core CLI Tools ---
brew "asdf"
brew "zoxide"
brew "git-lfs"
brew "lazygit"
brew "neovim"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tmux"
brew "tmuxinator"
brew "uv"
brew "btop"
brew "lazydocker"
brew "zsh-autosuggestions"

# --- Kubernetes & Container Tools ---
brew "kubectl"
brew "kubectx"           # Context/namespace switcher (kx, kn)
brew "k9s"               # Terminal UI for Kubernetes
brew "k3d"               # k3s in Docker for local dev
brew "helm"              # Kubernetes package manager
brew "stern"             # Multi-pod log tailing
brew "docker"

# --- Development ---
brew "cocoapods"
brew "mkcert"
brew "node"
brew "nss"
brew "nvm"
brew "postgresql@14", restart_service: :changed
brew "protobuf"
brew "yarn"

# --- Casks (GUI Apps) ---
cask "aerospace"
cask "android-commandlinetools"
cask "android-platform-tools"
cask "cursor"
cask "dbeaver-community"
cask "font-hack"
cask "font-symbols-only-nerd-font"
cask "karabiner-elements"
cask "obsidian"
cask "raycast"
cask "windsurf"
cask "zulu@17"
cask "tailscale"
cask "discord"
cask "spotify"

# --- Game Streaming ---
# Note: Sunshine on macOS is experimental (no gamepad support, needs BlackHole for audio)
brew "lizardbyte/homebrew/sunshine"
cask "moonlight"
