# Taps
tap "nikitabobko/tap"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "lizardbyte/homebrew"
tap "felixkratz/formulae"

# --- Core CLI Tools ---
brew "asdf"
brew "fzf"
brew "zoxide"
brew "git-lfs"
brew "lazygit"
brew "neovim"
brew "ripgrep"
brew "starship"
brew "tree-sitter"  # required by nvim-treesitter (main branch) to compile parsers
brew "stow"
brew "tmux"
brew "smug"  # tmux session manager (replaced tmuxinator)
brew "uv"
brew "btop"
brew "bun"
brew "lazydocker"
brew "zsh-autosuggestions"
brew "poppler"  # pdftoppm/pdfinfo — lets agents render PDFs to images for Read
brew "imagemagick"  # convert/magick — snacks.nvim inline image preview for non-PNG (jpeg/webp)
brew "gcalcli"  # Google Calendar from the CLI (agenda, reminders) — cross-platform meeting notifs
brew "ical-buddy"  # reads system Calendar (EventKit) — feeds SketchyBar next-meeting item
brew "gh"       # GitHub CLI (PRs, issues, CI) — preferred over any GitHub MCP
brew "pandoc"   # universal document converter
brew "d2"       # declarative diagram language

# --- Kubernetes & Container Tools ---
brew "kubectl"
brew "kubectx"           # Context/namespace switcher (kx, kn)
brew "k9s"               # Terminal UI for Kubernetes
brew "k3d"               # k3s in Docker for local dev
brew "helm"              # Kubernetes package manager
brew "stern"             # Multi-pod log tailing
brew "docker"
brew "colima"            # Container runtime (Docker/k8s) on macOS without Docker Desktop
brew "docker-compose"    # Compose plugin for colima/docker

# --- Development ---
brew "cocoapods"
brew "mkcert"
brew "node"
brew "nss"
brew "postgresql@14", restart_service: :changed
brew "protobuf"
brew "yarn"
brew "rustup"            # Rust toolchain installer (notes-cli, ticket CLI, etc.)
brew "awscli"           # AWS CLI
brew "cloudflared"      # Cloudflare tunnel daemon / DNS-over-HTTPS client
brew "marp-cli"         # Marp slide deck renderer (marp-slide skill)
brew "mermaid-cli"      # Mermaid diagram renderer / mmdc (deck CLI: .mmd -> svg)

# --- Skills support ---
brew "imagesnap"        # webcam capture CLI — webcam-ops / brightsign-visual-check skills

# --- Status Bar (Waybar analog for macOS) ---
brew "felixkratz/formulae/sketchybar"
cask "font-sketchybar-app-font"
# SF Symbols (browser app) requires sudo to install; the SF fonts ship with macOS already.
# Uncomment + run interactively if you want the browser app:
# cask "sf-symbols"

# --- Casks (GUI Apps) ---
cask "aerospace"
cask "android-commandlinetools"
cask "android-platform-tools"
cask "cursor"
cask "dbeaver-community"
cask "font-hack"
cask "font-symbols-only-nerd-font"
cask "karabiner-elements"
cask "raycast"
cask "windsurf"
cask "zulu@17"
cask "tailscale-app"  # GUI menu-bar app (Tailscale split the old `tailscale` cask; formula = CLI-only)
cask "discord"
cask "spotify"
cask "meetingbar"     # menu-bar next-meeting + native notifications (Google Calendar via Internet Accounts)

# --- Bluetooth audio control (bose-audio guard: stop macOS auto-grabbing the QC35 II) ---
brew "blueutil"        # CLI Bluetooth connect/disconnect/state — drives the bose-audio guard
brew "switchaudio-osx" # SwitchAudioSource: set default audio in/out devices from the CLI

# --- Game Streaming ---
# Note: Sunshine on macOS is experimental (no gamepad support, needs BlackHole for audio)
brew "lizardbyte/homebrew/sunshine"
cask "moonlight"

# --- Untracked on this machine — decide whether these belong on every Mac ---
# Found by `brew-audit` but not yet adopted: may be machine-specific one-offs. Uncomment to track.
# brew "mosquitto"      # MQTT broker/client (homelab)
# brew "node_exporter"  # Prometheus host metrics exporter (homelab)
# brew "sshpass"        # non-interactive ssh password auth
# brew "arp-scan"       # local network scanner
# brew "picocom"        # serial console
# brew "weasyprint"     # HTML/CSS → PDF renderer
# brew "zsh"            # newer zsh than macOS system zsh
# cask "codex"          # OpenAI Codex desktop
# cask "devin-desktop"  # Devin desktop
