tap "derailed/k9s"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "nikitabobko/tap"
brew "python@3.13"
brew "autojump"
brew "cocoapods"
brew "cowsay"
brew "docker-compose"
brew "fnm"
brew "fortune"
brew "fzf"
brew "gh"
brew "helm"
brew "neovim"
brew "node"
brew "postgresql@14", restart_service: :changed
brew "ripgrep"
brew "rust"
brew "rustup"
brew "starship"
brew "stow"
brew "zsh"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "derailed/k9s/k9s"
brew "hashicorp/tap/vault"
brew "jesseduffield/lazydocker/lazydocker"
brew "jesseduffield/lazygit/lazygit"
cask "aerospace"
cask "android-platform-tools"
cask "dbeaver-community"
cask "docker"
cask "fly"
cask "kitty"
