tap "nikitabobko/tap"
brew "asdf"
brew "autojump"
brew "cocoapods"
brew "docker"
brew "git-lfs"
brew "lazygit"
brew "mkcert"
brew "neovim"
brew "node"
brew "nss"
brew "nvm"
brew "postgresql@14", restart_service: :changed
brew "protobuf"
brew "ripgrep"
brew "starship"
brew "stow"
brew "yarn"
brew "zsh-autosuggestions"
cask "aerospace"
cask "android-commandlinetools"
cask "android-platform-tools"
cask "dbeaver-community"
cask "font-hack"
cask "font-symbols-only-nerd-font"
cask "karabiner-elements"
